let figures = new Vue({
    el: "#figures",
    data: {
        name: 'figures',
        route: './aerospace_figures.html',
        figures: {
            "王伟": {
                imgName: "1.png",
                title: "海空卫士 燃烧的荣光——王伟",
                text: [
                    "王伟：浙江湖州人，中国海军航空兵飞行员，烈士。在2001年4月1日8时55分，美国海军的EP-3电子情报侦察机在中国海南岛东南70海里的中国领空内，与王伟驾驶的歼-8II战斗机发生碰撞，歼-8II战斗机坠毁。在此次中美撞机事件中，王伟跳伞下落不明，后被确认牺牲。",
                    "他从小立志报国，高中毕业后自愿应招入伍，在部队勤勉敬业，意志坚定，全身心投入到飞行事业中。努力学习高科技知识，刻苦钻研飞行技术，无论驾驶哪种战机，他都能做到地面苦练，空中精飞，成为四种气象飞行员，每次飞行考核都是优秀。他积极进取，在军校学习时，第一个当班长、区队长，第一批入党，在部队改装歼七飞机时，他第一个放单飞，始终保持昂扬的精神状态。他经常担负重大飞行任务，多次立功受奖。",
                    "王伟在飞行职业生涯中，积极关注新技术，不断挑战自我。他参与过多次重大空军演习，代表我国空军参加过多国军事交流，获得了无数荣誉与奖励。他始终保持着强烈的使命感和责任心，航空技术的不断进步让他更加深入地理解了蓝天的神奇与壮美。他的勇敢与坚持默默影响着一代又一代的未来飞行员，将飞行的热情传承下去。 ",
                    "2001年4月1日上午，王伟奉命执行对非法进入我国领空的美军用侦察机跟踪监视任务，美侦察机不仅多次无视中方发出的警告，还在飞行中突然大转向，撞毁中国战机，致使飞行员王伟失踪，后查明王伟在座机被美机撞毁后跳伞落海，光荣牺牲，年仅33岁。王伟落海后，海军及地方有关单位和人民群众，克服海上恶劣环境和复杂气候等困难，连续奋战了14个昼夜，展开了大规模的搜救行动。全国各族人民以各种方式表达了对王伟同志安危的牵挂之情，强烈谴责美方侵犯中国主权的霸道行径，体现了中华民族的伟大凝聚力。在执行这次任务时，王伟坚毅果敢，沉着冷静，英勇顽强，用生命谱写了一曲爱国主义和革命英雄主义的壮丽凯歌。",
                    "王伟，他的名字犹如一颗耀眼的星辰，永远闪耀在我们心间。他是一位伟大的空军英模，凭着自己的努力和执着，将飞翔的梦想化作华丽的翅膀，在蓝天中展翅高飞。他是空中的守护神，是保家卫国的勇士。他的奋斗精神和英勇事迹永远鼓舞着我们，激励着整个空军。愿天空中的每一轮朝日都能见证空军英雄的光辉，愿我们永远记住王伟这位伟大的飞行者。",
                ],
            },
            "程不时": {
                imgName: "2.png",
                title: "新中国第一代飞机设计师——程不时",
                text: [
                    "程不时，中国第一代飞机设计师，1930年出生于湖南醴陵。1951年毕业于清华大学航空工程系。在40多年的飞机设计生涯中，他负责过许多不同类型的飞机的总体设计，其中包括中国第一架喷气式飞机歼教1、第一架超音速飞机强5。他是中国第一架喷气式客机运10的副总设计师，还是国产大飞机C919的专家顾问团成员，并负责起草中国第一部适航标准。",
                    "幼年的程不时住在湖北汉阳机场附近，常常有飞机低低地越过他的头顶，引擎声吸引着他，这个引擎声来自日军的轰炸机。在战乱中辗转流离度过童年的程不时暗暗下定决心：“有朝一日我设计的飞机要像鹰一样翱翔天际。”初中时他郑重地向同学们宣布：“我将来要设计飞机。”高考时，程不时义无反顾地报考了中国第一所建立航空工程系的大学--清华大学。入学后，面对中国航空事业发展势头微弱，学生毕业后很难找到合适工作的现状，他笃定的说：“哪怕就几个人，也要设计飞机！”",
                    "1951年，新中国决定建立航空工业，21岁的程不时加入了建设队伍。1958年，由他负责总体设计的中国第一架喷气式飞机“歼教1”飞向新中国的蓝天，标志着中国的自主设计能力进入喷气式时代。",
                    "1980年，由他参与设计的我国首架喷气式客机“运10”首飞成功，这是我国第一架自主研造、拥有完全自主知识产权的喷气式民用客机，也是我国在20世纪自主研造的最大飞机。",
                    "然而对于中国航空人而言，大飞机，依然是一个充满挑战的梦想。2007年，经过长期论证，国产大飞机C919正式立项。经过十年的磨砺，2017年5月5日，C919终于首飞成功。程不时望着C919昂首飞上天空，眼里充满泪水，他大声地说：“我们国家多少人为C919的腾飞努力了几十年，终于走到了这一步！这是一个了不起的胜利，一个非常重要的成就！”为大飞机之梦奋斗了47年的程不时，终于圆梦。",
                    "程不时曾说：“飞机设计绝不是一个‘热闹’的工作，而是要吃苦，有时很枯燥，要耐得住寂寞。飞机设计师首先是一个创造者，有良好的判断力和预见性，在常规技术任务之外熟练运用语言、文字和图像等交流的技能，尤其应对飞行有必要的关注。新中国的航空工业从无到有、从有到强，是科学的胜利，也是开创精神的胜利。”关于未来，他提醒青年人：“真正的命脉绝不能掌握在别人手中。”",
                ],
            },
            "王海": {
                imgName: "3.png",
                title: "感动中国的“英雄飞行员”王海",
                text: [
                    "王海，山东威海人，1926年1月生，1944年5月参加革命工作，1945年9月加入中国共产党，1946年6月参军。在抗美援朝空战中，王海共击落击伤敌机9架，先后荣立过二等功、一等功、特等功，被空军授予“一级战斗英雄”称号。在中国人民革命军事博物馆，至今仍陈列着一架绘有9颗红星的米格-15歼击机，这就是王海当年驾驶过的功勋飞机。战机身上绘有9颗红星：5颗空心的星代表击伤敌机数量，4颗实心的星代表击落敌机数量。",
                    "2020年9月19日，军地各界人士前往北京八宝山送别一位老人，他是空军上将、原空军司令员、抗美援朝一等功臣王海。2021年2月17日，王海上将获颁2020年度感动中国年度人物，感动中国组委会的颁奖辞中写道：“在朝阳下俯冲，迎着西风开火。空中的尖刀、以一当十；疆土的坚盾、巡天为国。山河已无恙，祖国的雄鹰已飞得更高，你刻在机身上的星星，是战士们的巡航坐标。” ",
                    "顺着王海的飞行轨迹回望，那是一段百废待兴的新中国咬牙鏖战的历史。1950年6月，战火燃烧到鸭绿江边，美国对新生的中国虎视眈眈。为了维护中国人民的根本利益、保卫来之不易的和平环境，中国共产党毅然决定出兵朝鲜，抗击帝国主义的蛮横行径。衣衫褴褛的志愿军官兵，拿着美军认为扔进钢铁炉都不配的简陋武器，吃着美军认为连饲料都不如的少量食物，在漫天飞雪的崇山峻岭中，顶着成吨落下的钢铁火雨，前赴后继追逐着敌人的坦克和卡车，生生造就了“美国陆军史上最大败绩。",
                    "1951年11月18日下午，朝鲜清川江畔，硝烟弥漫，王海带领6架战鹰奉命迎击北犯之敌。当机群到达清川江附近上空时，王海发现低空有60多架美军飞机在盘旋活动，正向清川江桥投炸弹。王海当机立断，发出“跟我攻击”的命令，率领6架战鹰忽然从6000米高空直扑敌机。敌机突遭袭击，马上投下炸弹仓促应战，他们将飞机首尾相连形成一个大圆圈，当任何一架飞机受到攻击时，后面一架美机就会咬住对方的尾巴，使攻击者处于被动挨打地位。王海下令先爬高占位，再俯冲攻击，经过上下几次俯冲，美机“圆圈阵”被打乱了。60多架敌机被一大队6架战鹰勇猛的攻击打得惊恐万状、四下逃散。这一天，一大队创造了5:0的辉煌战绩。",
                    "就这样，在王海的率领下，一大队打一仗，进一步。到抗美援朝战争结束时，王海大队共参加空战80余次，击落击伤美机29架，荣立集体一等功。大队飞行员人人都有战绩，战鹰上架架都有红五星。王海更是创造了击落击伤美机9架的辉煌战绩，荣立特等功、一级战斗英雄荣誉称号，所带领的一大队也被誉为“英雄的王海大队”。",
                    "",
                    "",
                ],
            },
            // "": {
            //     imgName: "",
            //     title: "",
            //     text: [
            //         "",
            //         "",
            //         "",
            //         "",
            //         "",
            //         "",
            //         "",
            //         "",
            //     ],
            // },
        }
    },
    methods: {

    },
});